benchmark/old_outputs/single_thread/sieve_new/uni_64/2026-04-17T20:50:18-04:00_1_9_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1094804
number of failed transactions: 0 (0.000%)
latency average = 0.329 ms
initial connection time = 2.790 ms
tps = 6082.326894 (without initial connection time)
SQL script 1: pgscripts/uniform_select.sql
 - weight: 1 (targets 10.0% of total)
 - 109688 transactions (10.0% of total)
 - number of transactions actually processed: 109688 (tps = 609.386038)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.106 ms
 - latency stddev = 0.021 ms
SQL script 2: pgscripts/uniform_update.sql
 - weight: 9 (targets 90.0% of total)
 - 985116 transactions (90.0% of total)
 - number of transactions actually processed: 985116 (tps = 5472.940855)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.353 ms
 - latency stddev = 0.293 ms
ratio: .7806976297150631